Revit 2027 API
IDirectContext3DServer.UsesHandles Method
 Tests whether this server uses DirectContext3D handle elements.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
bool UsesHandles()
Function UsesHandles As Boolean
bool UsesHandles()
abstract UsesHandles : unit -> bool
Return Value
Boolean
 True if the server needs to use DirectContext3D handle elements, false otherwise.
Remarks
In the current release servers that use handle elements can only work with internal addins.
Third-party implementers should return 'false'.
See Also
Reference
IDirectContext3DServer Interface
Autodesk.Revit.DB.DirectContext3D Namespace